# まあこれがlinear equationの本質なので

# n = 2, 4, 8, 16 までは実験できるかな？
# n = 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16でカリキュラム学習を？

# 逆行列を求めるのと同じ？det(0)
# Aを与えて、det(A)を求める
# その結果が0ならば、逆行列は存在しない
# linear equationも一応タスクとして追加するか...？
# loopedの出力方法は色々あるな...
# なんとなく自然なのを選べば良いか。これはマスクを追加してそこを使う的な
# 6 a + 1 b + 9 c = 10 , 7 a + 3 b + 9 c = 9 , 9 a + 10 b + 8 c = 6

# [ 6 1 9 | 7 3 9 | 9 10 8 ] で 0 / 1で良いか、流石に難しいか...
# 逆行列を教師として与えるか...？それならmodにする必要あるか？それはNCなのか...？

# NC2のタスクだからこれを頑張りたいな...

# 整数上で定義する

# とりあえずはした三角行列？簡単なやつ
# その後に徐々に難しくする？
# これが解けたとして何が嬉しいんだろう...